; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p12---int100n150-m25---int100c150---s221---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level7 level7)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level7 level8)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level7 level9)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level7 level10)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level7 level11)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level7 level12)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level7 level13)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level7 level14)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level7 level15)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level7 level16)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level7 level17)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level7 level18)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level7 level19)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level7 level20)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level7 level21)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level7 level22)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level7 level23)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level7 level24)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level7 level25)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level7 level26)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level7 level27)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level7 level28)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level7 level29)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level7 level30)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level7 level31)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level7 level32)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level7 level33)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level7 level34)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level7 level35)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level7 level36)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level7 level37)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level3 level34)
(sum level31 level7 level38)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level3 level35)
(sum level32 level7 level39)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level3 level36)
(sum level33 level7 level40)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level3 level37)
(sum level34 level7 level41)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level3 level38)
(sum level35 level7 level42)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level3 level39)
(sum level36 level7 level43)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level3 level40)
(sum level37 level7 level44)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level3 level41)
(sum level38 level7 level45)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level3 level42)
(sum level39 level7 level46)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level3 level43)
(sum level40 level7 level47)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level3 level44)
(sum level41 level7 level48)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level3 level45)
(sum level42 level7 level49)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level21 level63)
(sum level43 level3 level46)
(sum level43 level7 level50)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level21 level64)
(sum level44 level3 level47)
(sum level44 level7 level51)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level21 level65)
(sum level45 level3 level48)
(sum level45 level7 level52)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level21 level66)
(sum level46 level3 level49)
(sum level46 level7 level53)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level47 level3 level50)
(sum level47 level7 level54)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level48 level3 level51)
(sum level48 level7 level55)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level49 level3 level52)
(sum level49 level7 level56)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level50 level3 level53)
(sum level50 level7 level57)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level51 level3 level54)
(sum level51 level7 level58)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level52 level3 level55)
(sum level52 level7 level59)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level53 level3 level56)
(sum level53 level7 level60)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level54 level3 level57)
(sum level54 level7 level61)
(sum level54 level12 level66)
(sum level55 level3 level58)
(sum level55 level7 level62)
(sum level56 level3 level59)
(sum level56 level7 level63)
(sum level57 level3 level60)
(sum level57 level7 level64)
(sum level58 level3 level61)
(sum level58 level7 level65)
(sum level59 level3 level62)
(sum level59 level7 level66)
(sum level60 level3 level63)
(sum level61 level3 level64)
(sum level62 level3 level65)
(sum level63 level3 level66)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level3 l0 l3)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)
(connected l2 l3)
(fuelcost level13 l2 l3)
(connected l3 l0)
(fuelcost level3 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level13 l3 l2)

(at t0 l2)
(fuel t0 level66)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l1)
(at p3 l2)
(at p4 l2)
(at p5 l0)
(at p6 l2)
(at p7 l1)
(at p8 l3)
(at p9 l2)
(at p10 l1)
(at p11 l3)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l3)
(at p3 l0)
(at p4 l3)
(at p5 l1)
(at p6 l1)
(at p7 l2)
(at p8 l2)
(at p9 l0)
(at p10 l3)
(at p11 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 12
2. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 12
3. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 12
4. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 12
5. (drive t0 l2 l1 level54 level12 level66)
   deleted: (at t0 l2) (fuel t0 level66)
   added: (at t0 l1) (fuel t0 level54)
   goals met: 0 of 12
6. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
7. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 12
8. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 12
9. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 12
10. (drive t0 l1 l3 level47 level7 level54)
   deleted: (at t0 l1) (fuel t0 level54)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 0 of 12
11. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 1 of 12
12. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 2 of 12
13. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 3 of 12
14. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 4 of 12
15. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 4 of 12
16. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 4 of 12
17. (drive t0 l3 l0 level44 level3 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l0) (fuel t0 level44)
   goals met: 4 of 12
18. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 4 of 12
19. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 12
20. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 6 of 12
21. (drive t0 l0 l1 level19 level25 level44)
   deleted: (at t0 l0) (fuel t0 level44)
   added: (at t0 l1) (fuel t0 level19)
   goals met: 6 of 12
22. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 6 of 12
23. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 7 of 12
24. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 8 of 12
25. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 9 of 12
26. (drive t0 l1 l2 level7 level12 level19)
   deleted: (at t0 l1) (fuel t0 level19)
   added: (at t0 l2) (fuel t0 level7)
   goals met: 9 of 12
27. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 10 of 12
28. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 11 of 12
29. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 12 of 12
